{
  "about": "关于",
  "topSection": {
    "title": "I’m Lixing SUN",
    "subtitle": "A Developer/Consultant based in China. ",
    "paragraph": "Have 7 years of software development experience. While focusing more on frontend, also have practical experience in backend development, architecture design and DevOps. Experienced in E2E products from idea to release. Have deep understanding of Agile development, with rich experience of leading Agile team. A motivated, resonsible, team-oriented fast learner with strong can-do attitude.",
    "resume": "Browse my resume to know more about me"
  },
  "keywordsSection": {
    "keywords": "Keywords",
    "ui": "UI Development",
    "frameworks": "React/Vue/Angular",
    "testing": "Automated Testing",
    "responsive": "Responsive Design",
    "charts": "Charts",
    "engineering": "Engineering",
    "agile": "Agile Development",
    "cicd": "CI/CD",
    "cloud": "AWS/Azure",
    "architecture": "Architecture Design",
    "tools": "Tools",
    "ide": "VSCode/Jetbrains",
    "design": "Sketch/Figma",
    "atlassian": "Atlassian Products",
    "trello": "Trello"
  },
  "experienceSection": {
    "experience": "Experience",
    "projects": "Projects",
    "confidentialNote": "*Due to confidentiality agreement, no demonstration is availalbe",
    "companies": [
      {
        "name": "Thoughtworks",
        "titles": "Senior Consultant / Senior UI Dev / Tech Lead",
        "period": "2018 - 2023",
        "region": "Asia",
        "summary": "Delivered several cross-region projects in Agile way with high quality. Played as the lead role in the delivery team, contributing on both technical and business sides with clients. Also served as the member of department core team and office frontend community core team.",
        "tags": [
          "Agile",
          "React",
          "Angular",
          "Kotlin",
          "PostgreSQL",
          "AWS",
          "Azure",
          "Atlassian"
        ],
        "projects": [
          {
            "name": "Cross Region Banking Platform",
            "region": "Asia",
            "title": "Tech Lead",
            "period": "Sep 2022 - Jan 2023",
            "tags": [
              "React",
              "tailwindcss",
              "microfrontend",
              "microservice",
              "Java",
              "Jira",
              "Confluence",
              "Bitbucket",
              "Jenkins"
            ],
            "summary": [
              "Led an Agile team taking charge of an essential business module in the Web platform, which under a microfrontend & microservice architecture. ",
              "Achieved multiple releases through collaboration with several internal teams.",
              "Promoted several improvement on tech stack and Agile way of working.",
              "Established strong and reliable relationship with the new client."
            ]
          },
          {
            "name": "Delivery Consultation",
            "region": "Asia",
            "title": "Internal Consultant",
            "period": "Mar 2022 - Sep 2022",
            "tags": [
              "Mural",
              "Trello",
              "piktochart"
            ],
            "summary": [
              "Supported leadership team of 2 projects to accomplish their big-bang releases.",
              "Identified issues & risks of the delivery and further planned with the core team.",
              "Built culture of continuous improvement and uplifted abilities of core members."
            ]
          },
          {
            "name": "Multi-track Government Project (Health Sector)",
            "region": "Asia",
            "title": "Tech Lead",
            "period": "Feb 2021 - Jan 2022",
            "tags": [
              "React",
              "Nest.js",
              "Typescript",
              "microservice",
              "PostgreSQL",
              "Jira",
              "Confluence",
              "Bitbucket",
              "Bamboo",
              "Azure"
            ],
            "summary": [
              "Evolved micro-service architecture under the program",
              "Led team on development with Agile Engineering Practices, and keep improving team way of working",
              "Enhanced the existing system on various dimensions (e.g. security, quality, etc.)",
              "Led team to provide quick response for urgent business requirement from clients",
              "Act as the anchor of the team with client higher management and other parties",
              "Led team on infrastructure and CI/CD on Azure Cloud"
            ]
          },
          {
            "name": "Government Platform (General Sector)",
            "region": "Asia",
            "title": "UI Lead",
            "period": "Jul 2019 – Nov 2020",
            "tags": [
              "React",
              "Angular",
              "Styleguidist",
              "PostgreSQL",
              "Kotlin",
              "Jira",
              "Confluence",
              "Bitbucket",
              "Bamboo",
              "AWS"
            ],
            "summary": [
              "Worked with clients during inception phase and produced a clear and reliable foundation of the project",
              "Led team on development with Agile Engineering Practices, and keep improving team way of working",
              "Act as the anchor of the team with client higher management and other parties, affecting both business decisions and technical solutions (e.g. component library)",
              "Hosted integration with downstream systems including standardized interface design, communication, implementation and following SIT",
              "Led team on infrastructure and CI/CD on AWS Cloud"
            ]
          },
          {
            "name": "Insurance Group Platform",
            "region": "Oceania",
            "title": "UI Developer",
            "period": "Dec 2018 – Jun 2019",
            "tags": [
              "React",
              "Jira",
              "Confluence",
              "Bitbucket"
            ],
            "summary": [
              "Took charge of form related UI features with React",
              "Took charge of integration features including cross-team communication and related knowledge sharing",
              "Helped BAs and QAs in team on analysis and testing of complex features"
            ]
          }
        ]
      },
      {
        "name": "Risewinter Technology",
        "titles": "Core UI Developer",
        "period": "2016 - 2018",
        "region": "China",
        "summary": "Contributed as a developer since startup of this esports data service company. Individually took charge of various web applications development and worked with PM on evolution of multiple products.",
        "tags": [
          "Vue",
          "D3.js",
          "echarts",
          "Node.js",
          "socket.io",
          "iView",
          "Material Design",
          "Polymer"
        ]
      }
    ]
  },
  "lifeSection": {
    "aboutLife": "More About My Life",
    "content": [
      {
        "title": "Travel",
        "content": "I pretty enjoy travel with my family. It makes me keep experiencing new sight and culture, also meet new people with different background. It also help me get out of the urban life and get closer to nature."
      },
      {
        "title": "Drawing",
        "content": "Influenced by my parents, I started learning drawing when I was a child. I have experienced various type of drawing such as traditional Chinese painting and oil painting. It does help me keep improving the aesthetics and stay creative. Recent years I start interested in pixel art and enjoy making some pieces with Procreate on iPad or Aseprite on PC."
      },
      {
        "title": "Esports",
        "content": "Video game is my favorite way of having fun since very young. I enjoy every single journey which is full of uncertainty especially with friends, or diving into the fantastic worlds that game producers design. For my favorite Esports game TFT (Teamfight Tactics), I enjoy playing against the top players in China or even in the world. I have even attended a few competitions and luckily won some prizes including championship."
      }
    ]
  }
}